; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v6 - type_1 ?v4 - type_2)
 	      (pred_2 ?v2 - object ?v4 - type_2)
	      (pred_3 ?v6 - type_1 ?v3 - type_3)
	      (pred_1 ?v6 - type_1 ?v2 - object ?v3 - type_3))

   (:action op_1
       :parameters  (?v6 - type_1 ?v8 ?v5 - type_2)
       :precondition (and  (pred_4 ?v6 ?v8))
       :effect (and  (pred_4 ?v6 ?v5)
		     (not (pred_4 ?v6 ?v8))))

   (:action op_3
       :parameters (?v6 - type_1 ?v1 - object ?v7 - type_2 ?v3 - type_3)
       :precondition  (and  (pred_2 ?v1 ?v7) (pred_4 ?v6 ?v7) (pred_3 ?v6 ?v3))
       :effect (and (pred_1 ?v6 ?v1 ?v3)
		    (not (pred_2 ?v1 ?v7)) 
		    (not (pred_3 ?v6 ?v3))))

   (:action op_2
       :parameters (?v6 - type_1 ?v1 - object ?v7 - type_2 ?v3 - type_3)
       :precondition  (and  (pred_1 ?v6 ?v1 ?v3) (pred_4 ?v6 ?v7))
       :effect (and (pred_2 ?v1 ?v7)
		    (pred_3 ?v6 ?v3)
		    (not (pred_1 ?v6 ?v1 ?v3)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_06 - type_1
obj_07 obj_05 - type_3
obj_04 obj_09 obj_08 - type_2
obj_03 obj_02 obj_01 - object)
(:init
(pred_4 obj_06 obj_09)
(pred_3 obj_06 obj_07)
(pred_3 obj_06 obj_05)
(pred_2 obj_03 obj_08)
(pred_2 obj_02 obj_04)
(pred_2 obj_01 obj_08)
)
(:goal
(and
(pred_2 obj_03 obj_09)
(pred_2 obj_02 obj_04)
(pred_2 obj_01 obj_08)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_06 ?b obj_05))))
)
)

; plan
1. (op_1 obj_06 obj_09 obj_08)
   deleted: (pred_4 obj_06 obj_09)
   added: (pred_4 obj_06 obj_08)
   goals met: 2 of 3
2. (op_3 obj_06 obj_03 obj_08 obj_07)
   deleted: (pred_2 obj_03 obj_08) (pred_3 obj_06 obj_07)
   added: (pred_1 obj_06 obj_03 obj_07)
   goals met: 2 of 3
3. (op_1 obj_06 obj_08 obj_09)
   deleted: (pred_4 obj_06 obj_08)
   added: (pred_4 obj_06 obj_09)
   goals met: 2 of 3
4. (op_2 obj_06 obj_03 obj_09 obj_07)
   deleted: (pred_1 obj_06 obj_03 obj_07)
   added: (pred_2 obj_03 obj_09) (pred_3 obj_06 obj_07)
   goals met: 3 of 3
